Revit 2027 API
BuiltInFailures.ConversionFailures.UndefinedTemperatureUnit Property
 Undefined temperature unit: '[Temperature Unit Type Name]'
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UndefinedTemperatureUnit { get; }
Public Shared ReadOnly Property UndefinedTemperatureUnit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UndefinedTemperatureUnit {
	FailureDefinitionId^ get ();
}
static member UndefinedTemperatureUnit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConversionFailures Class
Autodesk.Revit.DB Namespace